sessions/F03-market-open-connection-storm/results/raw/th50-r2-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 2600 max VUs, 1m0s max duration (incl. graceful stop):
              * market_open: Up to 400.00 iterations/s for 30s over 3 stages (maxVUs: 2600, gracefulStop: 30s)


running (0m00.8s), 0004/2600 VUs, 22 complete and 0 interrupted iterations
market_open   [   3% ] 0004/2600 VUs  00.8s/30s  065.11 iters/s

running (0m01.8s), 0008/2600 VUs, 122 complete and 0 interrupted iterations
market_open   [   6% ] 0008/2600 VUs  01.8s/30s  144.50 iters/s

running (0m02.8s), 0015/2600 VUs, 299 complete and 0 interrupted iterations
market_open   [   9% ] 0015/2600 VUs  02.8s/30s  224.32 iters/s

running (0m03.8s), 0087/2600 VUs, 492 complete and 0 interrupted iterations
market_open   [  13% ] 0087/2600 VUs  03.8s/30s  304.50 iters/s

running (0m04.8s), 0234/2600 VUs, 689 complete and 0 interrupted iterations
market_open   [  16% ] 0234/2600 VUs  04.8s/30s  384.40 iters/s

running (0m05.8s), 0440/2600 VUs, 882 complete and 0 interrupted iterations
market_open   [  19% ] 0440/2600 VUs  05.8s/30s  400.00 iters/s

running (0m06.8s), 0643/2600 VUs, 1079 complete and 0 interrupted iterations
market_open   [  23% ] 0643/2600 VUs  06.8s/30s  400.00 iters/s

running (0m07.8s), 0849/2600 VUs, 1273 complete and 0 interrupted iterations
market_open   [  26% ] 0849/2600 VUs  07.8s/30s  400.00 iters/s

running (0m08.8s), 1052/2600 VUs, 1469 complete and 0 interrupted iterations
market_open   [  29% ] 1052/2600 VUs  08.8s/30s  400.00 iters/s

running (0m09.8s), 1263/2600 VUs, 1659 complete and 0 interrupted iterations
market_open   [  33% ] 1263/2600 VUs  09.8s/30s  400.00 iters/s

running (0m10.8s), 1464/2600 VUs, 1858 complete and 0 interrupted iterations
market_open   [  36% ] 1464/2600 VUs  10.8s/30s  400.00 iters/s

running (0m11.8s), 1673/2600 VUs, 2049 complete and 0 interrupted iterations
market_open   [  39% ] 1673/2600 VUs  11.8s/30s  400.00 iters/s

running (0m12.8s), 1873/2600 VUs, 2248 complete and 0 interrupted iterations
market_open   [  43% ] 1873/2600 VUs  12.8s/30s  400.00 iters/s

running (0m13.8s), 2084/2600 VUs, 2438 complete and 0 interrupted iterations
market_open   [  46% ] 2084/2600 VUs  13.8s/30s  400.00 iters/s

running (0m14.8s), 2293/2600 VUs, 2629 complete and 0 interrupted iterations
market_open   [  49% ] 2293/2600 VUs  14.8s/30s  400.00 iters/s

running (0m15.8s), 2494/2600 VUs, 2828 complete and 0 interrupted iterations
market_open   [  53% ] 2494/2600 VUs  15.8s/30s  400.00 iters/s
time="2026-07-31T10:01:02Z" level=warning msg="Insufficient VUs, reached 2600 active VUs and cannot initialize more" executor=ramping-arrival-rate scenario=market_open

running (0m16.8s), 2600/2600 VUs, 3019 complete and 0 interrupted iterations
market_open   [  56% ] 2600/2600 VUs  16.8s/30s  400.00 iters/s

running (0m17.8s), 2596/2600 VUs, 3218 complete and 0 interrupted iterations
market_open   [  59% ] 2596/2600 VUs  17.8s/30s  400.00 iters/s

running (0m18.8s), 2600/2600 VUs, 3408 complete and 0 interrupted iterations
market_open   [  63% ] 2600/2600 VUs  18.8s/30s  400.00 iters/s

running (0m19.8s), 2596/2600 VUs, 3608 complete and 0 interrupted iterations
market_open   [  66% ] 2596/2600 VUs  19.8s/30s  400.00 iters/s

running (0m20.8s), 2600/2600 VUs, 3798 complete and 0 interrupted iterations
market_open   [  69% ] 2600/2600 VUs  20.8s/30s  400.00 iters/s

running (0m21.8s), 2600/2600 VUs, 3991 complete and 0 interrupted iterations
market_open   [  73% ] 2600/2600 VUs  21.8s/30s  400.00 iters/s

running (0m22.8s), 2600/2600 VUs, 4181 complete and 0 interrupted iterations
market_open   [  76% ] 2600/2600 VUs  22.8s/30s  400.00 iters/s

running (0m23.8s), 2595/2600 VUs, 4379 complete and 0 interrupted iterations
market_open   [  79% ] 2595/2600 VUs  23.8s/30s  400.00 iters/s

running (0m24.8s), 2600/2600 VUs, 4572 complete and 0 interrupted iterations
market_open   [  83% ] 2600/2600 VUs  24.8s/30s  400.00 iters/s

running (0m25.8s), 2599/2600 VUs, 4764 complete and 0 interrupted iterations
market_open   [  86% ] 2599/2600 VUs  25.8s/30s  335.50 iters/s

running (0m26.8s), 2595/2600 VUs, 4962 complete and 0 interrupted iterations
market_open   [  89% ] 2596/2600 VUs  26.8s/30s  255.34 iters/s

running (0m27.8s), 2592/2600 VUs, 5152 complete and 0 interrupted iterations
market_open   [  93% ] 2592/2600 VUs  27.8s/30s  175.50 iters/s

running (0m28.8s), 2537/2600 VUs, 5342 complete and 0 interrupted iterations
market_open   [  96% ] 2537/2600 VUs  28.8s/30s  095.92 iters/s

running (0m29.8s), 2403/2600 VUs, 5532 complete and 0 interrupted iterations
market_open   [  99% ] 2403/2600 VUs  29.8s/30s  015.27 iters/s

running (0m30.8s), 2204/2600 VUs, 5732 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m31.8s), 2014/2600 VUs, 5922 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m32.8s), 1822/2600 VUs, 6114 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m33.8s), 1624/2600 VUs, 6312 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m34.8s), 1434/2600 VUs, 6502 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m35.8s), 1244/2600 VUs, 6692 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m36.8s), 1044/2600 VUs, 6892 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m37.8s), 0854/2600 VUs, 7082 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m38.8s), 0664/2600 VUs, 7272 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m39.8s), 0472/2600 VUs, 7464 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m40.8s), 0271/2600 VUs, 7665 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s

running (0m41.8s), 0080/2600 VUs, 7856 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2364/2600 VUs  30s  006.32 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 31744  751.771282/s
    checks_succeeded...: 25.00% 7936 out of 31744
    checks_failed......: 75.00% 23808 out of 31744

    ✗ 200 정상 응답
      ↳  99% — ✓ 7931 / ✗ 5
    ✗ 503 부하 차단(의도된 흘려보냄)
      ↳  0% — ✓ 0 / ✗ 7936
    ✗ 500 서버오류(커넥션 타임아웃)
      ↳  0% — ✓ 5 / ✗ 7931
    ✗ 응답 못 받음(status 0)
      ↳  0% — ✓ 0 / ✗ 7936

    CUSTOM
    cnt_200........................: 7931   187.824409/s
    cnt_500........................: 5      0.118412/s
    dur_200_ok.....................: avg=8.35s  min=50.99ms med=9.28s  max=15.12s p(90)=13.46s p(95)=13.65s
    dur_500_error..................: avg=14.41s min=11.3s   med=15.18s max=15.22s p(90)=15.21s p(95)=15.21s

    HTTP
    http_req_duration..............: avg=8.35s  min=50.99ms med=9.28s  max=15.22s p(90)=13.46s p(95)=13.65s
      { expected_response:true }...: avg=8.35s  min=50.99ms med=9.28s  max=15.12s p(90)=13.46s p(95)=13.65s
    http_req_failed................: 0.06%  5 out of 7936
    http_reqs......................: 7936   187.94282/s

    EXECUTION
    dropped_iterations.............: 2063   48.856608/s
    iteration_duration.............: avg=8.35s  min=51.2ms  med=9.28s  max=15.22s p(90)=13.46s p(95)=13.65s
    iterations.....................: 7936   187.94282/s
    vus............................: 80     min=4         max=2600
    vus_max........................: 2600   min=2600      max=2600

    NETWORK
    data_received..................: 1.0 MB 24 kB/s
    data_sent......................: 595 kB 14 kB/s



running (0m42.2s), 0000/2600 VUs, 7936 complete and 0 interrupted iterations
market_open ✓ [ 100% ] 0000/2600 VUs  30s  006.32 iters/s